Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/openwrt-luci-acme.tmx
Source language: en
Languages: sv

source: See instructions
sv: Läs instruktionerna

source: Default
sv: Standard

source: Webroot directory
sv: Webroot-katalog

source: Package is not installed
sv: Paketet är inte installerat

source: Invalid domain. Allowed lowercase a-z, numbers and hyphen -
sv: Ogiltig domän. Tillåtna tecken är gemenerna a–z, siffror och bindestreck (-).

source: Days until renewal
sv: Dagar till förnyelse

source: Add multiple entries here in KEY=VAL shell variable format to supply multiple credential variables.
sv: Lägg till flera poster här i skalvariabelformatet NYCKEL=VÄRDE för att tillhandahålla flera autentiseringsuppgifter.

source: Alternative DNS API options
sv: Alternativa DNS-API-alternativ

source: Note that the domain names in the certificate must already be configured to point at the router's public IP address.
sv: Observera att domännamnen i certifikatet redan måste vara konfigurerade att peka på routerns publika IP-adress.

source: LUCI only supports one challenge domain per certificate.
sv: LUCI stöder endast en utmaningsdomän per certifikat.

source: Validation via TLS ALPN
sv: Validering via TLS-ALPN

source: Certificate Profile
sv: Certifikatprofil

source: Found DDNS domains
sv: Hittade DDNS-domäner

source: Get certificate from the Letsencrypt staging server (use for testing; the certificate won't be valid).
sv: Hämta certifikat från Let's Encrypts testserver (används för testning; certifikatet blir inte giltigt).

source: To temporary open port you can specify your web server port e.g. 80.
sv: För att tillfälligt öppna en port kan du ange webbserverns port, t.ex. 80.

source: Certificates
sv: Certifikat

source: It may be needed to change if your web server is behind reverse proxy and uses a different port.
sv: Det kan behöva ändras om webbservern finns bakom en omvänd proxy och använder en annan port.

source: Key type
sv: Nyckeltyp

source: The challenge alias to use for ALL domains.
sv: Utmaningsaliaset som ska användas för ALLA domäner.

source: Enable debug logging
sv: Aktivera felsökningsloggning

source: Cancel
sv: Avbryt

source: Standalone
sv: Fristående

source: Using this mode requires the acme-dnsapi package to be installed.
sv: Det här läget kräver att paketet acme-dnsapi är installerat.

source: This configures ACME (Letsencrypt) automatic certificate installation. Simply fill out this to have the router configured with Letsencrypt-issued certificates for the web interface.
sv: Här konfigureras automatisk certifikatinstallation med ACME (Let's Encrypt). Fyll i inställningarna för att konfigurera routern med certifikat utfärdade av Let's Encrypt för webbgränssnittet.

source: Once configured, issuing certificates can take a while. Check the logs for progress and any errors.
sv: När konfigurationen är klar kan det ta en stund att utfärda certifikat. Kontrollera loggarna för förlopp och eventuella fel.

source: Use a custom CA instead of Let's Encrypt.
sv: Använd en anpassad CA i stället för Let's Encrypt.

source: wildcards * require Validation method: DNS
sv: jokertecken (*) kräver valideringsmetoden DNS

source: See more
sv: Visa mer

source: %s for the list of available APIs.
sv: %s för en lista över tillgängliga API:er.

source: Email address to associate with account key.
sv: E-postadress att koppla till kontonyckeln.

source: Domain names
sv: Domännamn

source: Challenge Alias
sv: Utmaningsalias

source: Public Certificate
sv: Offentligt certifikat

source: Save
sv: Spara

source: Check the configurations of the added domain certificates
sv: Kontrollera konfigurationerna för de tillagda domäncertifikaten

source: ACME global config
sv: Global ACME-konfiguration

source: Import
sv: Importera

source: Advanced Settings
sv: Avancerade inställningar

source: Use staging server
sv: Använd testserver

source: ACME Log
sv: ACME-logg

source: %s for the format of credentials required by each API.
sv: %s för formatet på autentiseringsuppgifterna som krävs av respektive API.

source: RSA 2048 bits
sv: RSA 2048 bitar

source: Port where to listen for ACME challenge requests. The port will be temporarily open during validation.
sv: Port som ska lyssna efter ACME-utmaningsförfrågningar. Porten öppnas tillfälligt under valideringen.

source: To use DNS mode to issue certificates, set this to the name of a DNS API supported by acme.sh.
sv: För att utfärda certifikat i DNS-läge anger du namnet på ett DNS-API som stöds av acme.sh.

source: Key size (and type) for the generated certificate.
sv: Nyckelstorlek (och typ) för det genererade certifikatet.

source: Issued on
sv: Utfärdades den

source: ECC 256 bits
sv: ECC 256 bitar

source: ECC 384 bits
sv: ECC 384 bitar

source: If a certificate wasn't renewed in time then you'll receive a notice at 20 days before expiry.
sv: Om ett certifikat inte förnyas i tid får du en avisering 20 dagar innan det upphör att gälla.

source: Listen port
sv: Lyssningsport

source: DNS mode is also the only mode that supports wildcard certificates.
sv: DNS-läget är också det enda läget som stöder jokerteckencertifikat.

source: Wait for DNS update
sv: Vänta på DNS-uppdatering

source: The domain %s in DDNS %s is already configured in %s. Please check it after the importing.
sv: Domänen %s i DDNS %s är redan konfigurerad i %s. Kontrollera den efter importen.

source: RSA 3072 bits
sv: RSA 3072 bitar

source: DNS API credentials
sv: Autentiseringsuppgifter för DNS-API

source: In DNS mode, the domain name does not have to resolve to the router IP.
sv: I DNS-läge behöver domännamnet inte peka på routerns IP-adress.

source: Configure
sv: Konfigurera

source: The domain alias to use for ALL domains.
sv: Domänaliaset att använda för ALLA domäner.

source: Grant UCI access for luci-app-acme
sv: Ge luci-app-acme UCI-åtkomst

source: RSA 4096 bits
sv: RSA 4096 bitar

source: Certificate config
sv: Konfiguration för certifikatet

source: Webserver root directory. Set this to the webserver document root to run Acme in webroot mode. The web server must be accessible from the internet on port 80.
sv: Webbserverns rotkatalog. Ange webbserverns dokumentrot för att köra ACME i Webroot-läge. Webbservern måste vara nåbar från internet på port 80.

source: Enabled
sv: Aktiverad

source: ACME certificates
sv: ACME-certifikat

source: ACME server URL
sv: ACME-serverns URL

source: Domain names to include in the certificate. The first name will be the subject name, subsequent names will be alt names. Note that all domain names must point at the router in the global DNS.
sv: Domännamn att inkludera i certifikatet. Det första namnet blir subjektnamn. Efterföljande namn blir alternativa namn. Observera att alla domännamn måste peka på routern i den globala DNS.

source: Custom ACME server directory URL.
sv: Anpassad URL till ACME-serverns katalog.

source: Validate via TLS port 443.
sv: Validera via TLS-port 443.

source: General Settings
sv: Allmänna inställningar

source: Main Domain
sv: Huvuddomän

source: Log View
sv: Loggvy

source: LUCI only supports one challenge alias per certificate.
sv: LUCI stöder endast ett utmaningsalias per certifikat.

source: Account email
sv: Kontots e-postadress

source: Validation method
sv: Valideringsmetod

source: %s for the details of this process.
sv: %s för information om den här processen.

source: Cert files are stored in
sv: Certifikatfiler lagras i

source: Domain Alias
sv: Alias för domänen

source: Webroot Challenge Validation
sv: Validering av Webroot-utmaning

source: DNS Challenge Validation
sv: DNS-utmaningsvalidering

source: Seconds to wait for a DNS record to be updated before continue.
sv: Antal sekunder att vänta på att en DNS-post uppdateras innan processen fortsätter.

source: Standalone mode will use the built-in webserver of acme.sh to issue a certificate. Webroot mode will use an existing webserver to issue a certificate. DNS mode will allow you to use the DNS API of your DNS provider to issue a certificate.
sv: Fristående läge använder den inbyggda webbservern i acme.sh för att utfärda ett certifikat. Webroot-läge använder en befintlig webbserver. DNS-läge låter dig använda DNS-leverantörens DNS-API för att utfärda ett certifikat.

source: Private Key
sv: Privat nyckel

source: Install package %s
sv: Installera paket %s

source: The credentials for the DNS API mode selected above.
sv: Autentiseringsuppgifterna för DNS-API-läget som valts ovan.
